import { OrdersQueryFilterType, OrderStatusEnum } from "../../types";
import { AppStateType } from "./../store";

const getOrdersState = (state: AppStateType) => state.orders;

const testOrders = [
  {
    id: 1,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Новая заявка",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.NEW,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 2,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Новая заявка 1",
    description: "Короткое описание",
    orderStatus: OrderStatusEnum.NEW,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 3,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Новая заявка 2",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.NEW,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 4,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Новая заявка 3",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.NEW,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 5,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Новая заявка 4",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.NEW,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 6,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Заявка в архиве",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.ARCHIVED,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 7,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Заявка в архиве 1",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.ARCHIVED,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 8,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Заявка в архиве 2",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.ARCHIVED,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 9,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Удаленная заявка",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.DELETED,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 10,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Удаленная заявка 12",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.DELETED,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 11,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Новая заявка 112",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.NEW,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 12,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Новая заявка 31",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.NEW,
    customerId: 1,
    deadline: "До конца года",
  },
  {
    id: 13,
    number: "SD-00012",
    creationDate: "25-08-2021 12:45",
    actualDate: "25-09-2021 23:59",
    title: "Новая заявка 20",
    description:
      "Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000 Трансформаторы Трансформатор Т1000 Трансформатор Т1000 Трансформатор Т1000",
    orderStatus: OrderStatusEnum.NEW,
    customerId: 1,
    deadline: "До конца года",
  },
];

export const getOrdersListState =
  (searchText: string, filter: OrdersQueryFilterType) =>
  (state: AppStateType) =>
    // getOrdersState(state)
    //   .orders?
    testOrders
      .filter((order) => {
        if (filter === "active") {
          return order.orderStatus === OrderStatusEnum.NEW;
        } else if (filter === "deleted") {
          return order.orderStatus === OrderStatusEnum.DELETED;
        } else if (filter === "archived") {
          return order.orderStatus === OrderStatusEnum.ARCHIVED;
        }
        return true;
      })
      ?.filter((order) =>
        order.title.toLowerCase().includes(searchText.toLowerCase())
      );

export const getOrdersLoadingState = (state: AppStateType) =>
  getOrdersState(state).ordersLoading;

export const getOrdersErrorState = (state: AppStateType) =>
  getOrdersState(state).ordersError;

export const getNewOrderSpecializationState = (state: AppStateType) =>
  getOrdersState(state).newOrderSpecialization;

export const getOrderActionStatusState = (state: AppStateType) =>
  getOrdersState(state).orderActionStatus;

export const getCurrentOrderState = (state: AppStateType) =>
  getOrdersState(state).currentOrder;
